sim-transient-compressible/system/boundarySurfaceAverageFunctions.in
face_000_0
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_0;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
face_000_1
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_1;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
face_000_2
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_2;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
face_000_3
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_3;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
face_000_4
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_4;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
face_000_5
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 face_000_5;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 stress_term_dev 
	 	 stress_term_dev_macro 
	 ); 
} 
 
