sim-transient-compressible/system/surfaceAverageFunctions.in
box_000_ws
{ 
	 type 	 surfaceFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 faceZone; 
	 name 	 box_000_ws;
	 operation 	 areaIntegrate; 
	 fields 
	( 
	 	 ten_dot_norm 
	 ); 
} 
 
